# Usage `brew bundle Brewfile`

# Make sure everything is up to date
# brew update

# Upgrade anything already installed
# brew upgrade

# Install GNU core utilities (those that come with OS X are outdated)
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew 'coreutils'
# Install some other useful utilities like `sponge`
brew 'moreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew 'findutils'
# Install Bash 4
# Note: don’t forget to add `/usr/local/bin/bash` to `/etc/shells` before running `chsh`.
brew 'bash'
brew 'bash-completion'

# Add extra repos
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'telemachus/homebrew-desc'

# Install the essentials
brew 'git'
brew 'hub'
brew 'tree'
brew 'wget', args: ['enable-iri']
brew 'vim'
brew 'macvim', args: ['with-override-system-vim']
brew 'ssh-copy-id'
brew 'mobile-shell'
brew 'openssl'
brew 'wget'
brew 'tree'
brew 'android-platform-tools'
brew 'tmux'
brew 'webkit2png'
brew 'entr'
brew 'pwgen'
brew 'pv'

# And my favourite apps
cask 'alfred'
cask 'caffeine'
cask 'flux'
cask 'google-chrome'
cask 'iterm2'
cask 'jumpcut'
cask 'lastpass'
cask 'telegram'
cask 'vlc'
cask 'keka'
cask 'menumeters'
cask 'xquartz'
cask 'mac2imgur'
cask 'spectacle'
cask 'imageoptim'
cask 'google-drive'
